cylinder_cyclicAMI/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{


    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    sidewall1
    {
        type            zeroGradient;
    }

    sidewall2
    {
        type            zeroGradient;
    }

    upperwall
    {
        type            zeroGradient;
    }

    lowerwall
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            zeroGradient;
    }


}


// ************************************************************************* //
