cylinder_cyclicAMI/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    lowerwall
    {
        type            cyclicAMI;
        neighbourPatch  upperwall;
    }
    upperwall
    {
        type            cyclicAMI;
        neighbourPatch  lowerwall;
    }
}

U
{
    boundaryField
    {
        lowerwall
        {
            type            cyclicAMI;
            neighbourPatch  upperwall;
        }

        upperwall
        {
            type            cyclicAMI;
            neighbourPatch  lowerwall;
        }
    }
}

p
{
    boundaryField
    {
      lowerwall
      {
          type            cyclicAMI;
          neighbourPatch  upperwall;
      }

      upperwall
      {
          type            cyclicAMI;
          neighbourPatch  lowerwall;
      }
    }
}
// ************************************************************************* //
